# Pandas 库
> 处理带标签的数据
* series
* dataframe

In [20]:
import pandas as pd
data = pd.Series([1.5,3,4.5,6],index=["a","b","c","d"])
data

a    1.5
b    3.0
c    4.5
d    6.0
dtype: float64

* pd.Series(data,index=index,dtype=dtype)

* 增加数据类型

In [21]:
data = pd.Series([1.5,"3",4.5,6],index=["a","b","c","d"])
data

a    1.5
b      3
c    4.5
d      6
dtype: object

In [22]:
import numpy as np
x = np.arange(5)
pd.Series(x)

0    0
1    1
2    2
3    3
4    4
dtype: int64

* 用字典创建

In [23]:
population_dict= {"BeiJing":2154,"ShangHai":2424,"ShenZhen":1303,"HangZhou":981}
population = pd.Series(population_dict)
population

BeiJing     2154
ShangHai    2424
ShenZhen    1303
HangZhou     981
dtype: int64

* 字典创建，如果指定index，则会在字典的建中筛选，找不到为NaN

In [24]:
population = pd.Series(population_dict,index=["BeiJing","HangZhou","c","d"])
population

BeiJing     2154.0
HangZhou     981.0
c              NaN
d              NaN
dtype: float64

In [25]:
pd.Series(5,index=[100,200,300])

100    5
200    5
300    5
dtype: int64

## Pandas DataFrame 对象  
pd.DataFrame(data,index = index, columns = columns)  
data: 数据，可以使列表，字典，Numpy数组  
index:索引，可选参数  
columns:列标签，可选参数。

### 通过Series创建

In [26]:
population_dict= {"BeiJing":2154,"ShangHai":2424,"ShenZhen":1303,"HangZhou":981}
population = pd.Series(population_dict)
pd.DataFrame(population)

             0
BeiJing   2154
ShangHai  2424
ShenZhen  1303
HangZhou   981

In [27]:
pd.DataFrame(population,columns=["population"])

          population
BeiJing         2154
ShangHai        2424
ShenZhen        1303
HangZhou         981

2. ### 通过Series对象字典创建

In [28]:
GDP_dict= {"BeiJing":30320,"ShangHai":32322,"ShenZhen":25877,"HangZhou":31242}
GDP= pd.Series(GDP_dict)
pd.DataFrame({"population":population,"GDP":GDP})

          population    GDP
BeiJing         2154  30320
ShangHai        2424  32322
ShenZhen        1303  25877
HangZhou         981  31242

* 数量不够自动补齐

In [40]:
df =pd.DataFrame({"population":population,"GDP":GDP,"Country":"China"})

## 通过字典列表对象创建
* 字典索引作为index，字典键作为columns

In [30]:
data = [{"a":i,"b":2*i} for i in range(3)]
pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4

In [31]:
data =[{"a":1,"b":1},{"b":3,"c":4}] #自动补充
pd.DataFrame(data)

     a  b    c
0  1.0  1  NaN
1  NaN  3  4.0

* 通过二维数组

In [32]:
df=pd.DataFrame(np.random.randint(10,size = (3,2)),columns = ["foo","bar"],index = ["a","b","c"])

## DataFrame 属性

In [33]:
df.values

array([[9, 9],
       [7, 2],
       [9, 2]])

In [34]:
df.index

Index(['a', 'b', 'c'], dtype='object')

In [35]:
df.columns

Index(['foo', 'bar'], dtype='object')

In [36]:
df.size

6

In [37]:
df.shape

(3, 2)

In [161]:
GDP_dict= {"BeiJing":30320,"ShangHai":32322,"ShenZhen":25877,"HangZhou":31242}
GDP= pd.Series(GDP_dict)
df=pd.DataFrame({"population":population,"GDP":GDP})

In [162]:
df.GDP

BeiJing     30320
ShangHai    32322
ShenZhen    25877
HangZhou    31242
Name: GDP, dtype: int64

* 获取行  
绝对索引

In [42]:
df.loc["BeiJing"]

population     2154
GDP           30320
Country       China
Name: BeiJing, dtype: object

In [43]:
df.loc[["BeiJing","HangZhou"]]

          population    GDP Country
BeiJing         2154  30320   China
HangZhou         981  31242   China

In [46]:
df.loc["BeiJing","GDP"]

30320

相对索引

In [47]:
df.iloc[0]

population     2154
GDP           30320
Country       China
Name: BeiJing, dtype: object

In [48]:
df.iloc[[1,3]]

          population    GDP Country
ShangHai        2424  32322   China
HangZhou         981  31242   China

In [49]:
df.loc["BeiJing","GDP"]

30320

In [50]:
df.iloc[0,1]

30320

In [51]:
df.values[0][1]

30320

* Series 对象的索引

In [52]:
type (df.GDP)

pandas.core.series.Series

In [53]:
df.GDP["BeiJing"]

30320

In [54]:
dates = pd.date_range(start='2019-01-01',periods=6)
dates

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06'],
              dtype='datetime64[ns]', freq='D')

In [55]:
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns =["A","B","C","D"])
df

                   A         B         C         D
2019-01-01 -1.054939 -0.059228 -0.347765  0.956496
2019-01-02  0.043186  1.354191  0.194807 -0.365223
2019-01-03  0.896289 -0.418331 -0.185810 -0.294554
2019-01-04  0.556907 -0.419089 -1.387734  0.938867
2019-01-05 -2.515402 -0.170517  0.342163  0.105680
2019-01-06 -0.644753  0.712626  0.724648  0.741533

In [56]:
df["2019-01-01":"2019-01-03"]

                   A         B         C         D
2019-01-01 -1.054939 -0.059228 -0.347765  0.956496
2019-01-02  0.043186  1.354191  0.194807 -0.365223
2019-01-03  0.896289 -0.418331 -0.185810 -0.294554

In [57]:
df.loc["2019-01-01":"2019-01-03"]

                   A         B         C         D
2019-01-01 -1.054939 -0.059228 -0.347765  0.956496
2019-01-02  0.043186  1.354191  0.194807 -0.365223
2019-01-03  0.896289 -0.418331 -0.185810 -0.294554

In [58]:
df.iloc[0:2]

                   A         B         C         D
2019-01-01 -1.054939 -0.059228 -0.347765  0.956496
2019-01-02  0.043186  1.354191  0.194807 -0.365223

In [59]:
df.loc[:,"A":"C"]

                   A         B         C
2019-01-01 -1.054939 -0.059228 -0.347765
2019-01-02  0.043186  1.354191  0.194807
2019-01-03  0.896289 -0.418331 -0.185810
2019-01-04  0.556907 -0.419089 -1.387734
2019-01-05 -2.515402 -0.170517  0.342163
2019-01-06 -0.644753  0.712626  0.724648

In [60]:
df.loc["2019-01-02":"2019-01-3","C":"D"]

                   C         D
2019-01-02  0.194807 -0.365223
2019-01-03 -0.185810 -0.294554

In [61]:
df.loc["2019-01-02":"2019-01-3",["A","C"]]

                   A         C
2019-01-02  0.043186  0.194807
2019-01-03  0.896289 -0.185810

In [62]:
df.iloc[4:,[0,2]]

                   A         C
2019-01-05 -2.515402  0.342163
2019-01-06 -0.644753  0.724648

In [63]:
df.iloc[[1,2],[0,2]] # 绝对索引无法分散行嘞

                   A         C
2019-01-02  0.043186  0.194807
2019-01-03  0.896289 -0.185810

In [64]:
df[df > 0]

                   A         B         C         D
2019-01-01       NaN       NaN       NaN  0.956496
2019-01-02  0.043186  1.354191  0.194807       NaN
2019-01-03  0.896289       NaN       NaN       NaN
2019-01-04  0.556907       NaN       NaN  0.938867
2019-01-05       NaN       NaN  0.342163  0.105680
2019-01-06       NaN  0.712626  0.724648  0.741533

In [65]:
df.A > 0

2019-01-01    False
2019-01-02     True
2019-01-03     True
2019-01-04     True
2019-01-05    False
2019-01-06    False
Freq: D, Name: A, dtype: bool

In [66]:
df[df.A >0]

                   A         B         C         D
2019-01-02  0.043186  1.354191  0.194807 -0.365223
2019-01-03  0.896289 -0.418331 -0.185810 -0.294554
2019-01-04  0.556907 -0.419089 -1.387734  0.938867

In [67]:
df2 = df.copy()
df2['E'] = ['one','two','one','two',"three","four"]

In [68]:
df2

                   A         B         C         D      E
2019-01-01 -1.054939 -0.059228 -0.347765  0.956496    one
2019-01-02  0.043186  1.354191  0.194807 -0.365223    two
2019-01-03  0.896289 -0.418331 -0.185810 -0.294554    one
2019-01-04  0.556907 -0.419089 -1.387734  0.938867    two
2019-01-05 -2.515402 -0.170517  0.342163  0.105680  three
2019-01-06 -0.644753  0.712626  0.724648  0.741533   four

In [69]:
ind = df2["E"].isin(["two","four"])

In [70]:
ind

2019-01-01    False
2019-01-02     True
2019-01-03    False
2019-01-04     True
2019-01-05    False
2019-01-06     True
Freq: D, Name: E, dtype: bool

In [71]:
df2[ind]

                   A         B         C         D     E
2019-01-02  0.043186  1.354191  0.194807 -0.365223   two
2019-01-04  0.556907 -0.419089 -1.387734  0.938867   two
2019-01-06 -0.644753  0.712626  0.724648  0.741533  four

In [72]:
s1 = pd.Series([1,2,3,4,5,6],index = pd.date_range('20190101',periods=6))

In [73]:
df["E"] = s1
df

                   A         B         C         D  E
2019-01-01 -1.054939 -0.059228 -0.347765  0.956496  1
2019-01-02  0.043186  1.354191  0.194807 -0.365223  2
2019-01-03  0.896289 -0.418331 -0.185810 -0.294554  3
2019-01-04  0.556907 -0.419089 -1.387734  0.938867  4
2019-01-05 -2.515402 -0.170517  0.342163  0.105680  5
2019-01-06 -0.644753  0.712626  0.724648  0.741533  6

In [74]:
df["D"] = 6
df

                   A         B         C  D  E
2019-01-01 -1.054939 -0.059228 -0.347765  6  1
2019-01-02  0.043186  1.354191  0.194807  6  2
2019-01-03  0.896289 -0.418331 -0.185810  6  3
2019-01-04  0.556907 -0.419089 -1.387734  6  4
2019-01-05 -2.515402 -0.170517  0.342163  6  5
2019-01-06 -0.644753  0.712626  0.724648  6  6

In [75]:
df.loc["2019-01-01":"2019-01-03","D"] = 2

In [76]:
df

                   A         B         C  D  E
2019-01-01 -1.054939 -0.059228 -0.347765  2  1
2019-01-02  0.043186  1.354191  0.194807  2  2
2019-01-03  0.896289 -0.418331 -0.185810  2  3
2019-01-04  0.556907 -0.419089 -1.387734  6  4
2019-01-05 -2.515402 -0.170517  0.342163  6  5
2019-01-06 -0.644753  0.712626  0.724648  6  6

In [77]:
df.index = [i for i in range(len(df))]
df.columns = [i for i in range(df.shape[1])]
df

          0         1         2  3  4
0 -1.054939 -0.059228 -0.347765  2  1
1  0.043186  1.354191  0.194807  2  2
2  0.896289 -0.418331 -0.185810  2  3
3  0.556907 -0.419089 -1.387734  6  4
4 -2.515402 -0.170517  0.342163  6  5
5 -0.644753  0.712626  0.724648  6  6

## 数据运算及统计分析

1. 数据的查看

In [78]:
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns =["A","B","C","D"])
df

                   A         B         C         D
2019-01-01 -0.621256 -1.407276 -0.046651 -0.050780
2019-01-02 -1.408679  0.183350 -0.099355 -1.772979
2019-01-03  0.760279 -0.071533  0.096692 -1.308336
2019-01-04 -1.347127  0.239229  0.545972  1.470655
2019-01-05 -0.484981 -0.405909 -0.292482  1.231536
2019-01-06 -0.818074 -0.761633 -0.690417  0.241308

In [79]:
df.head() #默认5行

                   A         B         C         D
2019-01-01 -0.621256 -1.407276 -0.046651 -0.050780
2019-01-02 -1.408679  0.183350 -0.099355 -1.772979
2019-01-03  0.760279 -0.071533  0.096692 -1.308336
2019-01-04 -1.347127  0.239229  0.545972  1.470655
2019-01-05 -0.484981 -0.405909 -0.292482  1.231536

In [80]:
df.tail()

                   A         B         C         D
2019-01-02 -1.408679  0.183350 -0.099355 -1.772979
2019-01-03  0.760279 -0.071533  0.096692 -1.308336
2019-01-04 -1.347127  0.239229  0.545972  1.470655
2019-01-05 -0.484981 -0.405909 -0.292482  1.231536
2019-01-06 -0.818074 -0.761633 -0.690417  0.241308

In [81]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2019-01-01 to 2019-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 400.0 bytes

### Numpy运算
* 与numpy同样 可用DataFrame.values() 获取numpy的类型来加速

In [82]:
x = pd.DataFrame(np.arange(4).reshape(1,4))
x

   0  1  2  3
0  0  1  2  3

In [83]:
x + 5

   0  1  2  3
0  5  6  7  8

In [84]:
np.exp(x)

     0         1         2          3
0  1.0  2.718282  7.389056  20.085537

In [85]:
y = pd.DataFrame(np.arange(4,8).reshape(1,4))
y

   0  1  2  3
0  4  5  6  7

In [86]:
x * y

   0  1   2   3
0  0  5  12  21

> 纯粹的计算更侧重于numpy，Pandas更侧重于数据处理

### 广播运算

In [87]:
np.random.seed(42)
x = pd.DataFrame(np.random.randint(10,size=(3,3)),columns=list("ABC"))
x

   A  B  C
0  6  3  7
1  4  6  9
2  2  6  7

* 按行广播

In [88]:
x.iloc[0]

A    6
B    3
C    7
Name: 0, dtype: int64

In [89]:
x/x.iloc[0]

          A    B         C
0  1.000000  1.0  1.000000
1  0.666667  2.0  1.285714
2  0.333333  2.0  1.000000

* 按列广播

In [90]:
x.A

0    6
1    4
2    2
Name: A, dtype: int64

In [91]:
x.div(x.A,axis=0)

     A    B         C
0  1.0  0.5  1.166667
1  1.0  1.5  2.250000
2  1.0  3.0  3.500000

In [92]:
x.div(x.iloc[0],axis=1)

          A    B         C
0  1.000000  1.0  1.000000
1  0.666667  2.0  1.285714
2  0.333333  2.0  1.000000

### 新的用法

1. 索引对齐

In [93]:
A = pd.DataFrame(np.random.randint(0,20,size=(2,2)),columns=list("AB"))
B = pd.DataFrame(np.random.randint(0,20,size=(3,3)),columns=list("ABC"))

In [94]:
B

    A   B   C
0  11   5   1
1   0  11  11
2  16   9  15

In [95]:
A

   A  B
0  3  7
1  2  1

In [96]:
A+B

      A     B   C
0  14.0  12.0 NaN
1   2.0  12.0 NaN
2   NaN   NaN NaN

In [97]:
A.add(B,fill_value=0)

      A     B     C
0  14.0  12.0   1.0
1   2.0  12.0  11.0
2  16.0   9.0  15.0

### 统计相关

In [98]:
y = np.random.randint(3,size = 20)
y

array([2, 1, 1, 2, 1, 2, 2, 0, 2, 0, 2, 2, 0, 0, 2, 1, 0, 1, 1, 1])

In [99]:
np.unique(y)

array([0, 1, 2])

In [100]:
from collections import Counter
Counter(y)

Counter({2: 8, 1: 7, 0: 5})

In [101]:
y1 = pd.DataFrame(y,columns=["A"])
y1

    A
0   2
1   1
2   1
3   2
4   1
5   2
6   2
7   0
8   2
9   0
10  2
11  2
12  0
13  0
14  2
15  1
16  0
17  1
18  1
19  1

In [102]:
np.unique(y1)

array([0, 1, 2])

In [103]:
y1["A"].value_counts()

2    8
1    7
0    5
Name: A, dtype: int64

* 产生新的结果并排序

In [104]:
city_info = pd.DataFrame({"population":population,"GDP":GDP})

In [105]:
city_info["per_GDP"] = city_info.GDP / city_info.population

In [106]:
city_info

          population    GDP    per_GDP
BeiJing         2154  30320  14.076137
ShangHai        2424  32322  13.334158
ShenZhen        1303  25877  19.859555
HangZhou         981  31242  31.847095

In [107]:
city_info.sort_values(by="per_GDP") # 增序

          population    GDP    per_GDP
ShangHai        2424  32322  13.334158
BeiJing         2154  30320  14.076137
ShenZhen        1303  25877  19.859555
HangZhou         981  31242  31.847095

In [108]:
city_info.sort_values(by="per_GDP",ascending = False)

          population    GDP    per_GDP
HangZhou         981  31242  31.847095
ShenZhen        1303  25877  19.859555
BeiJing         2154  30320  14.076137
ShangHai        2424  32322  13.334158

In [109]:
city_info.sort_index()

          population    GDP    per_GDP
BeiJing         2154  30320  14.076137
HangZhou         981  31242  31.847095
ShangHai        2424  32322  13.334158
ShenZhen        1303  25877  19.859555

In [110]:
city_info.sort_index(axis=1,ascending=False)

          population    per_GDP    GDP
BeiJing         2154  14.076137  30320
ShangHai        2424  13.334158  32322
ShenZhen        1303  19.859555  25877
HangZhou         981  31.847095  31242

In [111]:
city_info

          population    GDP    per_GDP
BeiJing         2154  30320  14.076137
ShangHai        2424  32322  13.334158
ShenZhen        1303  25877  19.859555
HangZhou         981  31242  31.847095

In [112]:
city_info.count()

population    4
GDP           4
per_GDP       4
dtype: int64

In [113]:
city_info.idxmax()

population    ShangHai
GDP           ShangHai
per_GDP       HangZhou
dtype: object

In [114]:
city_info.quantile(0.75) # 分位数

population     2221.50000
GDP           31512.00000
per_GDP          22.85644
Name: 0.75, dtype: float64

In [115]:
df.describe() #获取一切

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.653307 -0.370629 -0.081040 -0.031433
std    0.788252  0.631988  0.410438  1.310693
min   -1.408679 -1.407276 -0.690417 -1.772979
25%   -1.214864 -0.672702 -0.244200 -0.993947
50%   -0.719665 -0.238721 -0.073003  0.095264
75%   -0.519050  0.119629  0.060856  0.983979
max    0.760279  0.239229  0.545972  1.470655

In [116]:
data_2 = pd.DataFrame([["a","a","c","d"],
                      ["c","a","c","b"],
                      ["a","a","d","c"]],columns = list("ABCD"))

In [117]:
data_2.describe()

        A  B  C  D
count   3  3  3  3
unique  2  1  2  3
top     a  a  c  c
freq    2  3  2  1

In [118]:
df.corr() # 相关性系数

          A         B         C         D
A  1.000000 -0.157993 -0.064317 -0.264170
B -0.157993  1.000000  0.489976 -0.135639
C -0.064317  0.489976  1.000000  0.116316
D -0.264170 -0.135639  0.116316  1.000000

In [119]:
df

                   A         B         C         D
2019-01-01 -0.621256 -1.407276 -0.046651 -0.050780
2019-01-02 -1.408679  0.183350 -0.099355 -1.772979
2019-01-03  0.760279 -0.071533  0.096692 -1.308336
2019-01-04 -1.347127  0.239229  0.545972  1.470655
2019-01-05 -0.484981 -0.405909 -0.292482  1.231536
2019-01-06 -0.818074 -0.761633 -0.690417  0.241308

In [120]:
df.apply(sum)

A   -3.919839
B   -2.223771
C   -0.486242
D   -0.188596
dtype: float64

In [121]:
df.apply(np.cumsum) # 可以设置 axis

                   A         B         C         D
2019-01-01 -0.621256 -1.407276 -0.046651 -0.050780
2019-01-02 -2.029936 -1.223926 -0.146006 -1.823759
2019-01-03 -1.269657 -1.295459 -0.049314 -3.132095
2019-01-04 -2.616784 -1.056230  0.496658 -1.661440
2019-01-05 -3.101765 -1.462139  0.204176 -0.429904
2019-01-06 -3.919839 -2.223771 -0.486242 -0.188596

In [122]:
df.sum()

A   -3.919839
B   -2.223771
C   -0.486242
D   -0.188596
dtype: float64

In [123]:
df.apply(lambda x:x.max()-x.min())

A    2.168958
B    1.646505
C    1.236389
D    3.243634
dtype: float64

In [124]:
def my_describe(x):
    return pd.Series([x.count(),x.mean(),x.max(),x.idxmin(),x.std()],\
                     index = ["Count","mean","max","idxmin","std"])

In [125]:
df.apply(my_describe)

,A,B,C,D
Count,6,6,6,6
mean,-0.653307,-0.370629,-0.0810403,-0.0314327
max,0.760279,0.239229,0.545972,1.47066
idxmin,2019-01-02 00:00:00,2019-01-01 00:00:00,2019-01-06 00:00:00,2019-01-02 00:00:00
std,0.788252,0.631988,0.410438,1.31069

In [126]:
data = pd.DataFrame(np.array([[1,np.nan,2],
                            [np.nan,3,4],
                            [5, 6, None]]),columns=["A", "B", "C"])

> 有None，字符串等等，数据类型全部为object，更加消耗资源

In [127]:
data.dtypes

A    object
B    object
C    object
dtype: object

In [128]:
data.isnull()

       A      B      C
0  False   True  False
1   True  False  False
2  False  False   True

In [129]:
data.notnull()

       A      B      C
0   True  False   True
1  False   True   True
2   True   True  False

> np.nan是一种特殊的浮点数

In [130]:
data.dropna() # aixs

Empty DataFrame
Columns: [A, B, C]
Index: []

In [131]:
data = pd.DataFrame(np.random.rand(3,4),columns = list("ABCD"))

In [132]:
data

          A         B         C         D
0  0.304614  0.097672  0.684233  0.440152
1  0.122038  0.495177  0.034389  0.909320
2  0.258780  0.662522  0.311711  0.520068

In [133]:
data["E"] = np.nan

In [134]:
data

          A         B         C         D   E
0  0.304614  0.097672  0.684233  0.440152 NaN
1  0.122038  0.495177  0.034389  0.909320 NaN
2  0.258780  0.662522  0.311711  0.520068 NaN

In [135]:
data.loc[0]["A"] = np.nan

In [136]:
data

          A         B         C         D   E
0       NaN  0.097672  0.684233  0.440152 NaN
1  0.122038  0.495177  0.034389  0.909320 NaN
2  0.258780  0.662522  0.311711  0.520068 NaN

In [137]:
data.dropna(axis="columns",how="all")

          A         B         C         D
0       NaN  0.097672  0.684233  0.440152
1  0.122038  0.495177  0.034389  0.909320
2  0.258780  0.662522  0.311711  0.520068

In [138]:
data.dropna(axis="columns",how="any")

          B         C         D
0  0.097672  0.684233  0.440152
1  0.495177  0.034389  0.909320
2  0.662522  0.311711  0.520068

In [139]:
data.dropna(axis="columns")

          B         C         D
0  0.097672  0.684233  0.440152
1  0.495177  0.034389  0.909320
2  0.662522  0.311711  0.520068

In [140]:
data.fillna(value=5)

          A         B         C         D    E
0  5.000000  0.097672  0.684233  0.440152  5.0
1  0.122038  0.495177  0.034389  0.909320  5.0
2  0.258780  0.662522  0.311711  0.520068  5.0

In [141]:
data.fillna(value=data.mean())

          A         B         C         D   E
0  0.190409  0.097672  0.684233  0.440152 NaN
1  0.122038  0.495177  0.034389  0.909320 NaN
2  0.258780  0.662522  0.311711  0.520068 NaN

In [142]:
data.fillna(value=data.stack().mean())

          A         B         C         D         E
0  0.412369  0.097672  0.684233  0.440152  0.412369
1  0.122038  0.495177  0.034389  0.909320  0.412369
2  0.258780  0.662522  0.311711  0.520068  0.412369

In [143]:
def make_df(cols,ind):
    "一个简单的DataFrame"
    data={c:[str(c) + str(i) for i in ind] for c in cols}
    return pd.DataFrame(data,ind)

make_df("ABC",range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [144]:
df_1 = make_df("AB",[1,2])
df_2 = make_df("AB",[3,4])

In [145]:
pd.concat([df_1,df_2],ignore_index=False) # 垂直合并

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [146]:
df_3 = make_df("AB",[0,1])
df_4 = make_df("CD",[3,4])
pd.concat([df_3,df_4],axis=1)

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
3  NaN  NaN   C3   D3
4  NaN  NaN   C4   D4

In [147]:
pd.concat([df_1,df_2],ignore_index=True)

    A   B
0  A1  B1
1  A2  B2
2  A3  B3
3  A4  B4

In [148]:
df_7 = make_df("ABC",[1,2])
df_8 = make_df("BCD",[3,4])

In [149]:
pd.concat([df_7,df_8],axis=1)

     A    B    C    B    C    D
1   A1   B1   C1  NaN  NaN  NaN
2   A2   B2   C2  NaN  NaN  NaN
3  NaN  NaN  NaN   B3   C3   D3
4  NaN  NaN  NaN   B4   C4   D4

In [150]:
df_9 = make_df("AB",[1,2])
df_10 = make_df("BC",[1,2])
pd.merge(df_9,df_10)

    A   B   C
0  A1  B1  C1
1  A2  B2  C2

In [151]:
GDP_dict = {"City":("BeiJing","ShangHai","HangZhou"),
           "GDP":(30320,32680,13468)}
GDP = pd.DataFrame(GDP_dict)
GDP

       City    GDP
0   BeiJing  30320
1  ShangHai  32680
2  HangZhou  13468

In [152]:
GDP.loc[3]=("hahaha",133)

In [153]:
GDP

       City    GDP
0   BeiJing  30320
1  ShangHai  32680
2  HangZhou  13468
3    hahaha    133

In [154]:
GDP.loc[4]=["haha",133]

In [155]:
GDP.loc[4,"City"] = "hehe" # 使用行，列的方式

In [156]:
GDP

       City    GDP
0   BeiJing  30320
1  ShangHai  32680
2  HangZhou  13468
3    hahaha    133
4      hehe    133

In [164]:

Pop_dict = {"City":("BeiJing","HangZhou","ShenZhen"),
           "Population":(30320,32680,13468)}
GDP_dict = {"City":("BeiJing","ShangHai","HangZhou"),
           "GDP":(30320,32680,13468)}
population = pd.DataFrame(Pop_dict)
GDP = pd.DataFrame(GDP_dict)
population

       City  Population
0   BeiJing       30320
1  HangZhou       32680
2  ShenZhen       13468

In [165]:
GDP

       City    GDP
0   BeiJing  30320
1  ShangHai  32680
2  HangZhou  13468

In [167]:
city_info = pd.merge(population,GDP) # 求得是交集
city_info

       City  Population    GDP
0   BeiJing       30320  30320
1  HangZhou       32680  13468

In [170]:
city_info = pd.merge(population,GDP,how="outer") # 求得是并集
city_info

       City  Population      GDP
0   BeiJing     30320.0  30320.0
1  HangZhou     32680.0  13468.0
2  ShenZhen     13468.0      NaN
3  ShangHai         NaN  32680.0

### 分组和数据透视表

In [173]:
df = pd.DataFrame({"key":["A","B","C","A","B","C"],
                  "data1":range(6),   #这是个字典
                  "data2":np.random.randint(0,10,size=6)})
df

  key  data1  data2
0   A      0      9
1   B      1      3
2   C      2      5
3   A      3      1
4   B      4      9
5   C      5      1

## 分组

* 延迟计算

In [177]:
df.groupby("key")

In [178]:
df.groupby("key").sum()

     data1  data2
key
A        3     10
B        5     12
C        7      6

In [179]:
df.groupby("key").mean()

     data1  data2
key
A      1.5    5.0
B      2.5    6.0
C      3.5    3.0

In [180]:
for i in df.groupby("key"):
    print(str(i))

('A',   key  data1  data2
0   A      0      9
3   A      3      1)
('B',   key  data1  data2
1   B      1      3
4   B      4      9)
('C',   key  data1  data2
2   C      2      5
5   C      5      1)

In [182]:
df.groupby("key")["data2"].sum()

key
A    10
B    12
C     6
Name: data2, dtype: int64

In [183]:
for data,group in df.groupby("key"):
    print("{0:5} shape{1}".format(data,group.shape))

A     shape(2, 3)
B     shape(2, 3)
C     shape(2, 3)

In [185]:
df.groupby("key")["data1"].describe()

     count  mean      std  min   25%  50%   75%  max
key
A      2.0   1.5  2.12132  0.0  0.75  1.5  2.25  3.0
B      2.0   2.5  2.12132  1.0  1.75  2.5  3.25  4.0
C      2.0   3.5  2.12132  2.0  2.75  3.5  4.25  5.0

* 支持更加复杂的操作

In [187]:
df.groupby("key").aggregate(["min","median","max"])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     1      5   9
B       1    2.5   4     3      6   9
C       2    3.5   5     1      3   5

In [188]:
def filter_func(x):
    return x["data2"].std() > 3
df.groupby("key")["data2"].std()

key
A    5.656854
B    4.242641
C    2.828427
Name: data2, dtype: float64

In [189]:
df.groupby("key").filter(filter_func)

  key  data1  data2
0   A      0      9
1   B      1      3
3   A      3      1
4   B      4      9

In [193]:
df[df["key"] == "A"]

  key  data1  data2
0   A      0      9
3   A      3      1

In [194]:
df.groupby("key").transform(lambda x:x - x.mean())

   data1  data2
0   -1.5    4.0
1   -1.5   -3.0
2   -1.5    2.0
3    1.5   -4.0
4    1.5    3.0
5    1.5   -2.0

In [195]:
df

  key  data1  data2
0   A      0      9
1   B      1      3
2   C      2      5
3   A      3      1
4   B      4      9
5   C      5      1

In [207]:
def norm_by_data2(x):
    x["data1"] /= x["data2"].mean() 
    return x

In [208]:
df.groupby("key").apply(norm_by_data2)

  key     data1  data2
0   A  0.000000      9
1   B  0.166667      3
2   C  0.666667      5
3   A  0.600000      1
4   B  0.666667      9
5   C  1.666667      1

* 将列表、数组设为分组键

In [210]:
L = [0, 1, 0, 1, 2, 0] # 分组键
df.groupby(L).sum()

   data1  data2
0      7     15
1      4      4
2      4      9

* 用字典将索引映射到分组

In [211]:
df2 = df.set_index("key")
df2

     data1  data2
key
A        0      9
B        1      3
C        2      5
A        3      1
B        4      9
C        5      1

In [212]:
mapping = {"A":"first","B":"constant","C":"constant"} # 字典的index对应的是key
df2.groupby(mapping).sum()

          data1  data2
constant     12     18
first         3     10

* 任意Python函数

In [213]:
df2.groupby(str.lower).mean()

   data1  data2
a    1.5    5.0
b    2.5    6.0
c    3.5    3.0

In [214]:
df2.groupby([str.lower,mapping]).mean()

            data1  data2
a first       1.5    5.0
b constant    2.5    6.0
c constant    3.5    3.0

* 例1，行星观测数据处理

In [216]:
import seaborn as sns
import pandas as pd
planets = sns.load_dataset("planets")
planets.shape

(1035, 6)

In [217]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [219]:
planets.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [225]:
planets["year"].head()

0    2006
1    2008
2    2011
3    2007
4    2009
Name: year, dtype: int64

In [221]:
decade = 10 *(planets["year"] // 10)
decade = decade.astype(str) +"s"
decade.name = "decade"
decade.head()

0    2000s
1    2000s
2    2010s
3    2000s
4    2000s
Name: decade, dtype: object

In [223]:
planets.groupby(["method",decade]).sum()

                                      number  orbital_period       mass  \
method                        decade
Astrometry                    2010s        2    1.262360e+03    0.00000
Eclipse Timing Variations     2000s        5    1.930800e+04    6.05000
                              2010s       10    2.345680e+04    4.20000
Imaging                       2000s       29    1.350935e+06    0.00000
                              2010s       21    6.803750e+04    0.00000
Microlensing                  2000s       12    1.732500e+04    0.00000
                              2010s       15    4.750000e+03    0.00000
Orbital Brightness Modulation 2010s        5    2.127920e+00    0.00000
Pulsar Timing                 1990s        9    1.900153e+02    0.00000
                              2000s        1    3.652500e+04    0.00000
                              2010s        1    9.070629e-02    0.00000
Pulsation Timing Variations   2000s        1    1.170000e+03    0.00000
Radial Velocity               1980s        1    8.388800e+01   11.68000
                              1990s       52    1.091561e+04   68.17820
                              2000s      475    2.633526e+05  945.31928
                              2010s      424    1.809630e+05  316.47890
Transit                       2000s       64    2.897102e+02    0.00000
                              2010s      712    8.087813e+03    1.47000
Transit Timing Variations     2010s        9    2.393505e+02    0.00000

                                       distance    year
method                        decade
Astrometry                    2010s       35.75    4023
Eclipse Timing Variations     2000s      261.44    6025
                              2010s     1000.00   12065
Imaging                       2000s      956.83   40139
                              2010s     1210.08   36208
Microlensing                  2000s        0.00   20070
                              2010s    41440.00   26155
Orbital Brightness Modulation 2010s     2360.00    6035
Pulsar Timing                 1990s        0.00    5978
                              2000s        0.00    2003
                              2010s     1200.00    2011
Pulsation Timing Variations   2000s        0.00    2007
Radial Velocity               1980s       40.57    1989
                              1990s      723.71   55943
                              2000s    15201.16  619775
                              2010s    11382.67  432451
Transit                       2000s    31823.31  124462
                              2010s   102419.46  673999
Transit Timing Variations     2010s     3313.00    8050

In [227]:
planets.groupby(["method",decade])["number"].sum().unstack().fillna(0)

decade                         1980s  1990s  2000s  2010s
method
Astrometry                       0.0    0.0    0.0    2.0
Eclipse Timing Variations        0.0    0.0    5.0   10.0
Imaging                          0.0    0.0   29.0   21.0
Microlensing                     0.0    0.0   12.0   15.0
Orbital Brightness Modulation    0.0    0.0    0.0    5.0
Pulsar Timing                    0.0    9.0    1.0    1.0
Pulsation Timing Variations      0.0    0.0    1.0    0.0
Radial Velocity                  1.0   52.0  475.0  424.0
Transit                          0.0    0.0   64.0  712.0
Transit Timing Variations        0.0    0.0    0.0    9.0

In [232]:
planets.groupby(["method",decade])["number"].sum().unstack()

decade                         1980s  1990s  2000s  2010s
method
Astrometry                       NaN    NaN    NaN    2.0
Eclipse Timing Variations        NaN    NaN    5.0   10.0
Imaging                          NaN    NaN   29.0   21.0
Microlensing                     NaN    NaN   12.0   15.0
Orbital Brightness Modulation    NaN    NaN    NaN    5.0
Pulsar Timing                    NaN    9.0    1.0    1.0
Pulsation Timing Variations      NaN    NaN    1.0    NaN
Radial Velocity                  1.0   52.0  475.0  424.0
Transit                          NaN    NaN   64.0  712.0
Transit Timing Variations        NaN    NaN    NaN    9.0

In [234]:
help(planets.groupby(["method",decade])["number"].sum().unstack)

Help on method unstack in module pandas.core.series:

unstack(level=-1, fill_value=None) method of pandas.core.series.Series instance
    Unstack, a.k.a. pivot, Series with MultiIndex to produce DataFrame.
    The level involved will automatically get sorted.

    Parameters
    ----------
    level : int, str, or list of these, default last level
        Level(s) to unstack, can pass level name.
    fill_value : scalar value, default None
        Value to use when replacing NaN values.

        .. versionadded:: 0.18.0

    Returns
    -------
    DataFrame
        Unstacked Series.

    Examples
    --------
    >>> s = pd.Series([1, 2, 3, 4],
    ...               index=pd.MultiIndex.from_product([['one', 'two'],
    ...                                                 ['a', 'b']]))
    >>> s
    one  a    1
         b    2
    two  a    3
         b    4
    dtype: int64

    >>> s.unstack(level=-1)
         a  b
    one  1  2
    two  3  4

    >>> s.unstack(level=0)
       one  two
    a    1    3
    b    2    4

In [236]:
import seaborn as sns

In [247]:
titanic = pd.read_csv("seaborn-data/titanic.csv")

In [248]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [249]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [252]:
titanic.groupby("sex")[["survived"]].mean() #两个中括号就是返回DataFrame

        survived
sex
female  0.742038
male    0.188908

In [253]:
titanic.groupby("sex")["survived"].mean() #一个中括号Series

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [254]:
titanic.groupby(["sex","class"])["survived"].aggregate("mean").unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

* 数据透视表

In [256]:
titanic.pivot_table("survived",index ="sex",columns="class") #默认返回平均值

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [257]:
titanic.pivot_table("survived",index ="sex",columns="class",aggfunc="mean",margins=True)

class      First    Second     Third       All
sex
female  0.968085  0.921053  0.500000  0.742038
male    0.368852  0.157407  0.135447  0.188908
All     0.629630  0.472826  0.242363  0.383838

In [260]:
titanic.pivot_table(index ="sex",columns="class",aggfunc={"survived":"sum","fare":"mean"})

              fare                       survived
class        First     Second      Third    First Second Third
sex
female  106.125798  21.970121  16.118810       91     70    72
male     67.226127  19.741782  12.661633       45     17    47

## 其他骚操作

(1) 向量化字符串操作  
(2) 处理时间序列  
(3) 多级索引：用于多维数组

In [267]:
base_data = np.array([[1771,11115],
          [2154,30320],
          [2141,14070],
          [2424,32680],
          [1077,7806],
          [1303,24222],
          [798,4789],
          [981,13468]])
data = pd.DataFrame(base_data,index=[["BeiJing","BeiJing","ShangHai","ShangHai","ShenZhen","ShenZhen","HangZhou" \
                                     ,"HangZhou"],[2008,2018]*4],columns=["population","GDP"])

In [268]:
data

               population    GDP
BeiJing  2008        1771  11115
         2018        2154  30320
ShangHai 2008        2141  14070
         2018        2424  32680
ShenZhen 2008        1077   7806
         2018        1303  24222
HangZhou 2008         798   4789
         2018         981  13468

In [269]:
data.index.names = ["city","year"]

In [270]:
data

               population    GDP
city     year
BeiJing  2008        1771  11115
         2018        2154  30320
ShangHai 2008        2141  14070
         2018        2424  32680
ShenZhen 2008        1077   7806
         2018        1303  24222
HangZhou 2008         798   4789
         2018         981  13468

In [274]:
data[["GDP","population"]]

                 GDP  population
city     year
BeiJing  2008  11115        1771
         2018  30320        2154
ShangHai 2008  14070        2141
         2018  32680        2424
ShenZhen 2008   7806        1077
         2018  24222        1303
HangZhou 2008   4789         798
         2018  13468         981

In [275]:
data.loc["ShangHai","GDP"]

year
2008    14070
2018    32680
Name: GDP, dtype: int64

In [276]:
data.loc["ShangHai",2018]

population     2424
GDP           32680
Name: (ShangHai, 2018), dtype: int64

In [277]:
data.loc["ShangHai"]

      population    GDP
year
2008        2141  14070
2018        2424  32680

## 高性能的Pandas:eval()

In [278]:
df1, df2, df3, df4 = (pd.DataFrame(np.random.random((100000,100))) for i in range(4))

In [282]:
%timeit (df1+df2)/(df3+df4)

57.6 ms ± 272 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

* 减少了符合式计算中间过程的内存分配

In [283]:
%timeit pd.eval("(df1+df2) / (df3 + df4)")
np.allclose((df1+df2)/(df3+df4),pd.eval("(df1+df2)/(df3+df4)"))

31.2 ms ± 1.08 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

True

In [287]:
df = pd.DataFrame(np.random.random((5,4)),index=range(5),columns =list("ABCD"))
df

          A         B         C         D
0  0.625590  0.227527  0.657258  0.264920
1  0.605368  0.917039  0.676471  0.362466
2  0.774479  0.001477  0.326121  0.754148
3  0.013640  0.787059  0.112611  0.045639
4  0.354031  0.877856  0.155698  0.472358

In [288]:
%timeit res_1 = df[(df.A<0.5) &(df.B >0.5)]

1.17 ms ± 2.27 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

## query()

In [290]:
%timeit res_2 = df.query("(A<0.5) &(B >0.5)")

2.17 ms ± 70.7 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

* 小数组时，普通方法好
* 数组大的时候，多用骚操作